<script lang="ts" setup>
import { ref } from 'vue'
const text=ref({
   "控制流混淆":[
    '代码展开：将循环和递归函数展开为多个重复语句',
    '逻辑转换：通过逻辑变换，如布尔运算(0和1)和逻辑运算的混合',
    '条件分枝插⼊：加⼊⼀些⽆⽤的条件分枝语句，使其迷惑恶意逆向⼯程师',
    '代码拆分：将代码拆分成多个函数，使得恶意逆向⼯程师，需要跨函数进⾏分析，加⼤分析难度',
    '代码重排：通过改变代码执⾏顺序，使得代码执⾏更复杂',
    '加密和解密(编码与解码)：通过对核⼼代码的特殊处理可以加强代码的复杂性，减少被恶意逆向的可能',
    '技术的实现：利⽤不透明谓词的模糊实现'
   ],
   "数据流混淆":[
    '数据流量的隐藏：将私密或者敏感的流量通过与其它流量进⾏混合，使其看起来普通不易被发现',
    '数据流⽅向的混淆：通过改变数据流传输的协议与⽅向，让其更加隐秘',
    '数据内容的混淆：通过加密、编码、打乱数据包的格式与内容，使得难以辨认',
    '数据的发送量以及发送时间：在某⼀时间我们进⾏⼤量的数据包发送，可以使得对⼿⽆法抓\
    取完整的内容，以及时间的突发性，可以是对⼿难以破解具体内容',
    '数据包的分割：我们可以在数据的传输过程中，对数据包进⾏不同⼤⼩的分割，或者部分合\
    并，让对⼿⽆法获得完整内容'
   ],
   "布局混淆":[
    '删除注释增加空格：对核⼼算法和代码块的注释进⾏删除或以⼀种内部⼈员能读懂形式进⾏\
    注释，并且增加⼤量空格和换⾏操作来进⾏混淆',
    '名字混淆：通过随机⽣成名字，改变变量名或者函数名等，以及使⽤缩写或者字符替换的⽅\
    式进⾏混淆',
    '代码拆分与合并：对核⼼代码进⾏⼀些分割，或者合并，最后通过代码运⾏时进⾏合并或者\
    拆分'
   ],
   "预防转换":[
    "控制流扁平化：将复杂的代码控制流程改为简单的流程，增加代码的难度和混淆度",
    '防⽌调试：添加⼀些⼿段防⽌对代码进⾏调试和分析',
    '有针对性的：对市⾯上的主流反编译器以及去混淆器的弱点进⾏探索',
    '固有的：⽤已知的去混淆技术去修补⼀些固有的问题'
   ]
})

</script>

<template>
  <div class="mx-5 mb-10 ">
    <div 
    class="border-8  rounded-lg bg-slate-50 p-2 my-3" 
    v-for="(value,key,index) in text"
    :key="index">
        <h3>{{ key }}</h3>
        <div 
        v-for="(item,index1) in value" 
        class="text-sm"
        :key="index1">
            {{ item }}
        </div>
    </div>
  </div>
</template>

<style scoped >

</style>
